TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Cpdma.h
/* ======================================================================
 *   Copyright (c) 2022-2025 Texas Instruments Incorporated
 *
 *   All rights reserved. Property of Texas Instruments Incorporated.
 *   Restricted rights to use, duplicate or disclose this code are
 *   granted through contract.
 *
 *   The program may not be used without the written permission
 *   of Texas Instruments Incorporated or against the terms and conditions
 *   stipulated in the agreement under which this program has been
 *   supplied.
 * ==================================================================== */

/*
 * Hw_Cpsw_Cpdma.h
 *
 * Register-level header file for CPSW_CPDMA
 *
 */

#ifndef HW_CPSW_CPDMA_H_
#define HW_CPSW_CPDMA_H_

#ifdef __cplusplus
extern "C"
{
#endif


/*******************************************************************************
* Register Definitions
*******************************************************************************/
#define CPSW_CPDMA_FH_IDVER_REG                          (0x00034000U)
#define CPSW_CPDMA_FH_CONTROL_REG                        (0x00034004U)
#define CPSW_CPDMA_FH_TEARDOWN_REG                       (0x00034008U)
#define CPSW_CPDMA_TH_IDVER_REG                          (0x00034010U)
#define CPSW_CPDMA_TH_CONTROL_REG                        (0x00034014U)
#define CPSW_CPDMA_TH_TEARDOWN_REG                       (0x00034018U)
#define CPSW_CPDMA_SOFT_RESET_REG                        (0x0003401CU)
#define CPSW_CPDMA_CONTROL_REG                           (0x00034020U)
#define CPSW_CPDMA_STATUS_REG                            (0x00034024U)
#define CPSW_CPDMA_TH_BUFFER_OFFSET_REG                  (0x00034028U)
#define CPSW_CPDMA_EMULATION_CONTROL_REG                 (0x0003402CU)
#define CPSW_CPDMA_FH_INTSTAT_RAW_REG                    (0x00034080U)
#define CPSW_CPDMA_FH_INTSTAT_MASKED_REG                 (0x00034084U)
#define CPSW_CPDMA_FH_INTSTAT_MASKED_SET_REG             (0x00034088U)
#define CPSW_CPDMA_FH_INTSTAT_MASKED_CLR_REG             (0x0003408CU)
#define CPSW_CPDMA_IN_VECTOR_REG                         (0x00034090U)
#define CPSW_CPDMA_EOI_VECTOR_REG                        (0x00034094U)
#define CPSW_CPDMA_TH_INTSTAT_RAW_REG                    (0x000340A0U)
#define CPSW_CPDMA_TH_INTSTAT_MASKED_REG                 (0x000340A4U)
#define CPSW_CPDMA_TH_INTSTAT_SET_REG                    (0x000340A8U)
#define CPSW_CPDMA_TH_INTSTAT_CLR_REG                    (0x000340ACU)
#define CPSW_CPDMA_INTSTAT_RAW_REG                       (0x000340B0U)
#define CPSW_CPDMA_INTSTAT_MASKED_REG                    (0x000340B4U)
#define CPSW_CPDMA_INTSTAT_SET_REG                       (0x000340B8U)
#define CPSW_CPDMA_INTSTAT_CLR_REG                       (0x000340BCU)
#define CPSW_CPDMA_TH_PENDTHRESH_REG(n)                  (0x000340C0U+((n) * 0x4U))
#define CPSW_CPDMA_TH_FREEBUFFER_REG(n)                  (0x000340E0U+((n) * 0x4U))
#define CPSW_CPDMA_FH_HDP_REG(n)                         (0x00034200U+((n) * 0x4U))
#define CPSW_CPDMA_TH_HDP_REG(n)                         (0x00034220U+((n) * 0x4U))
#define CPSW_CPDMA_FH_CP_REG(n)                          (0x00034240U+((n) * 0x4U))
#define CPSW_CPDMA_TH_CP_REG(n)                          (0x00034260U+((n) * 0x4U))

/*******************************************************************************
* Field Definition Macros
*******************************************************************************/
#define CPSW_CPDMA_TH_TEARDOWN_TDN_CH_SHIFT                        (0U)
#define CPSW_CPDMA_TH_TEARDOWN_TDN_CH_MASK                         (0x00000007U)

#define CPSW_CPDMA_TH_TEARDOWN_TDN_RDY_SHIFT                       (31U)
#define CPSW_CPDMA_TH_TEARDOWN_TDN_RDY_MASK                        (0x80000000U)

#define CPSW_CPDMA_FH_TEARDOWN_TDN_CH_SHIFT                        (0U)
#define CPSW_CPDMA_FH_TEARDOWN_TDN_CH_MASK                         (0x00000007U)

#define CPSW_CPDMA_FH_TEARDOWN_TDN_RDY_SHIFT                       (31U)
#define CPSW_CPDMA_FH_TEARDOWN_TDN_RDY_MASK                        (0x80000000U)

#define CPSW_CPDMA_DMA_INTSTAT_RAW_STAT_PEND_SHIFT                (0U)
#define CPSW_CPDMA_DMA_INTSTAT_RAW_STAT_PEND_MASK                 (0x00000001U)

#define CPSW_CPDMA_DMA_INTSTAT_RAW_HOST_PEND_SHIFT                (1U)
#define CPSW_CPDMA_DMA_INTSTAT_RAW_HOST_PEND_MASK                 (0x00000002U)

#define CPSW_CPDMA_RX_PENDTHRESH_RX_SHIFT                          (0U)
#define CPSW_CPDMA_RX_PENDTHRESH_RX_MASK                           (0x000000ffU)

#define CPSW_CPDMA_DMA_INTMASK_SET_STAT_INT_MASK_SHIFT             (0U)
#define CPSW_CPDMA_DMA_INTMASK_SET_STAT_INT_MASK_MASK              (0x00000001U)

#define CPSW_CPDMA_DMA_INTMASK_SET_HOST_ERR_INT_MASK_SHIFT         (1U)
#define CPSW_CPDMA_DMA_INTMASK_SET_HOST_ERR_INT_MASK_MASK          (0x00000002U)

#define CPSW_CPDMA_TH_CONTROL_EN_SHIFT                             (0U)
#define CPSW_CPDMA_TH_CONTROL_EN_MASK                              (0x00000001U)
#define CPSW_CPDMA_TH_CONTROL_EN_EN_0x1                            (1U)
#define CPSW_CPDMA_TH_CONTROL_EN_EN_0x0                            (0U)

#define CPSW_CPDMA_FH_CONTROL_EN_SHIFT                             (0U)
#define CPSW_CPDMA_FH_CONTROL_EN_MASK                              (0x00000001U)
#define CPSW_CPDMA_FH_CONTROL_EN_EN_0x1                            (1U)
#define CPSW_CPDMA_FH_CONTROL_EN_EN_0x0                            (0U)

#define CPSW_CPDMA_IN_VECTOR_DMA_SHIFT                             (0U)
#define CPSW_CPDMA_IN_VECTOR_DMA_MASK                              (0xffffffffU)

#define CPSW_CPDMA_DMA_INTSTAT_MASKED_STAT_PEND_SHIFT              (0U)
#define CPSW_CPDMA_DMA_INTSTAT_MASKED_STAT_PEND_MASK               (0x00000001U)

#define CPSW_CPDMA_DMA_INTSTAT_MASKED_HOST_PEND_SHIFT              (1U)
#define CPSW_CPDMA_DMA_INTSTAT_MASKED_HOST_PEND_MASK               (0x00000002U)

#define CPSW_CPDMA_TX_INTMASK_CLR_TX0_MASK_SHIFT                   (0U)
#define CPSW_CPDMA_TX_INTMASK_CLR_TX0_MASK_MASK                    (0x00000001U)

#define CPSW_CPDMA_TX_INTMASK_CLR_TX1_MASK_SHIFT                   (1U)
#define CPSW_CPDMA_TX_INTMASK_CLR_TX1_MASK_MASK                    (0x00000002U)

#define CPSW_CPDMA_TX_INTMASK_CLR_TX2_MASK_SHIFT                   (2U)
#define CPSW_CPDMA_TX_INTMASK_CLR_TX2_MASK_MASK                    (0x00000004U)

#define CPSW_CPDMA_TX_INTMASK_CLR_TX3_MASK_SHIFT                   (3U)
#define CPSW_CPDMA_TX_INTMASK_CLR_TX3_MASK_MASK                    (0x00000008U)

