TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Cpdma.h
#define CPSW_CPDMA_TX_INTMASK_CLR_TX4_MASK_SHIFT                   (4U)
#define CPSW_CPDMA_TX_INTMASK_CLR_TX4_MASK_MASK                    (0x00000010U)

#define CPSW_CPDMA_TX_INTMASK_CLR_TX5_MASK_SHIFT                   (5U)
#define CPSW_CPDMA_TX_INTMASK_CLR_TX5_MASK_MASK                    (0x00000020U)

#define CPSW_CPDMA_TX_INTMASK_CLR_TX6_MASK_SHIFT                   (6U)
#define CPSW_CPDMA_TX_INTMASK_CLR_TX6_MASK_MASK                    (0x00000040U)

#define CPSW_CPDMA_TX_INTMASK_CLR_TX7_MASK_SHIFT                   (7U)
#define CPSW_CPDMA_TX_INTMASK_CLR_TX7_MASK_MASK                    (0x00000080U)

#define CPSW_CPDMA_RX_BUFFER_OFFSET_SHIFT                          (0U)
#define CPSW_CPDMA_RX_BUFFER_OFFSET_MASK                           (0x0000ffffU)

#define CPSW_CPDMA_RX_INTMASK_SET_RX0_PEND_MASK_SHIFT              (0U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX0_PEND_MASK_MASK               (0x00000001U)

#define CPSW_CPDMA_RX_INTMASK_SET_RX1_PEND_MASK_SHIFT              (1U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX1_PEND_MASK_MASK               (0x00000002U)

#define CPSW_CPDMA_RX_INTMASK_SET_RX2_PEND_MASK_SHIFT              (2U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX2_PEND_MASK_MASK               (0x00000004U)

#define CPSW_CPDMA_RX_INTMASK_SET_RX3_PEND_MASK_SHIFT              (3U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX3_PEND_MASK_MASK               (0x00000008U)

#define CPSW_CPDMA_RX_INTMASK_SET_RX4_PEND_MASK_SHIFT              (4U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX4_PEND_MASK_MASK               (0x00000010U)

#define CPSW_CPDMA_RX_INTMASK_SET_RX5_PEND_MASK_SHIFT              (5U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX5_PEND_MASK_MASK               (0x00000020U)

#define CPSW_CPDMA_RX_INTMASK_SET_RX6_PEND_MASK_SHIFT              (6U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX6_PEND_MASK_MASK               (0x00000040U)

#define CPSW_CPDMA_RX_INTMASK_SET_RX7_PEND_MASK_SHIFT              (7U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX7_PEND_MASK_MASK               (0x00000080U)

#define CPSW_CPDMA_RX_INTMASK_SET_RX0_THRESH_PEND_MASK_SHIFT       (8U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX0_THRESH_PEND_MASK_MASK        (0x00000100U)

#define CPSW_CPDMA_RX_INTMASK_SET_RX1_THRESH_PEND_MASK_SHIFT       (9U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX1_THRESH_PEND_MASK_MASK        (0x00000200U)

#define CPSW_CPDMA_RX_INTMASK_SET_RX2_THRESH_PEND_MASK_SHIFT       (10U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX2_THRESH_PEND_MASK_MASK        (0x00000400U)

#define CPSW_CPDMA_RX_INTMASK_SET_RX3_THRESH_PEND_MASK_SHIFT       (11U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX3_THRESH_PEND_MASK_MASK        (0x00000800U)

#define CPSW_CPDMA_RX_INTMASK_SET_RX4_THRESH_PEND_MASK_SHIFT       (12U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX4_THRESH_PEND_MASK_MASK        (0x00001000U)

#define CPSW_CPDMA_RX_INTMASK_SET_RX5_THRESH_PEND_MASK_SHIFT       (13U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX5_THRESH_PEND_MASK_MASK        (0x00002000U)

#define CPSW_CPDMA_RX_INTMASK_SET_RX6_THRESH_PEND_MASK_SHIFT       (14U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX6_THRESH_PEND_MASK_MASK        (0x00004000U)

#define CPSW_CPDMA_RX_INTMASK_SET_RX7_THRESH_PEND_MASK_SHIFT       (15U)
#define CPSW_CPDMA_RX_INTMASK_SET_RX7_THRESH_PEND_MASK_MASK        (0x00008000U)

#define CPSW_CPDMA_SOFT_RESET_SHIFT                                (0U)
#define CPSW_CPDMA_SOFT_RESET_MASK                                 (0x00000001U)
#define CPSW_CPDMA_SOFT_RESET_EN_0x1                               (1U)
#define CPSW_CPDMA_SOFT_RESET_EN_0x0                               (0U)

#define CPSW_CPDMA_TX_PRI_RATE_PRIN_SEND_CNT_SHIFT                 (0U)
#define CPSW_CPDMA_TX_PRI_RATE_PRIN_SEND_CNT_MASK                  (0x00003fffU)

#define CPSW_CPDMA_TX_PRI_RATE_PRIN_IDLE_CNT_SHIFT                 (16U)
#define CPSW_CPDMA_TX_PRI_RATE_PRIN_IDLE_CNT_MASK                  (0x3fff0000U)

#define CPSW_CPDMA_TX_INTMASK_SET_TX0_MASK_SHIFT                   (0U)
#define CPSW_CPDMA_TX_INTMASK_SET_TX0_MASK_MASK                    (0x00000001U)

#define CPSW_CPDMA_TX_INTMASK_SET_TX1_MASK_SHIFT                   (1U)
#define CPSW_CPDMA_TX_INTMASK_SET_TX1_MASK_MASK                    (0x00000002U)

#define CPSW_CPDMA_TX_INTMASK_SET_TX2_MASK_SHIFT                   (2U)
#define CPSW_CPDMA_TX_INTMASK_SET_TX2_MASK_MASK                    (0x00000004U)

#define CPSW_CPDMA_TX_INTMASK_SET_TX3_MASK_SHIFT                   (3U)
#define CPSW_CPDMA_TX_INTMASK_SET_TX3_MASK_MASK                    (0x00000008U)

#define CPSW_CPDMA_TX_INTMASK_SET_TX4_MASK_SHIFT                   (4U)
#define CPSW_CPDMA_TX_INTMASK_SET_TX4_MASK_MASK                    (0x00000010U)

#define CPSW_CPDMA_TX_INTMASK_SET_TX5_MASK_SHIFT                   (5U)
#define CPSW_CPDMA_TX_INTMASK_SET_TX5_MASK_MASK                    (0x00000020U)

#define CPSW_CPDMA_TX_INTMASK_SET_TX6_MASK_SHIFT                   (6U)
#define CPSW_CPDMA_TX_INTMASK_SET_TX6_MASK_MASK                    (0x00000040U)

#define CPSW_CPDMA_TX_INTMASK_SET_TX7_MASK_SHIFT                   (7U)
#define CPSW_CPDMA_TX_INTMASK_SET_TX7_MASK_MASK                    (0x00000080U)

#define CPSW_CPDMA_EMCTRL_FREE_SHIFT                               (0U)
#define CPSW_CPDMA_EMCTRL_FREE_MASK                                (0x00000001U)

#define CPSW_CPDMA_EMCTRL_SOFT_SHIFT                               (1U)
#define CPSW_CPDMA_EMCTRL_SOFT_MASK                                (0x00000002U)

#define CPSW_CPDMA_DMACTRL_TX_PTYPE_SHIFT                          (0U)
#define CPSW_CPDMA_DMACTRL_TX_PTYPE_MASK                           (0x00000001U)
#define CPSW_CPDMA_DMACTRL_TX_PTYPE_PRIORITY_ROUNDROBIN            (0x00000000U)
#define CPSW_CPDMA_DMACTRL_TX_PTYPE_PRIORITY_FIXED                 (0x00000001U)

#define CPSW_CPDMA_DMACTRL_RX_OWNERSHIP_SHIFT                      (1U)
#define CPSW_CPDMA_DMACTRL_RX_OWNERSHIP_MASK                       (0x00000002U)

#define CPSW_CPDMA_DMACTRL_RX_OFFLEN_BLOCK_SHIFT                   (2U)
#define CPSW_CPDMA_DMACTRL_RX_OFFLEN_BLOCK_MASK                    (0x00000004U)

