TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Cpdma.h
#define CPSW_CPDMA_DMACTRL_CMD_IDLE_SHIFT                          (3U)
#define CPSW_CPDMA_DMACTRL_CMD_IDLE_MASK                           (0x00000008U)
#define CPSW_CPDMA_DMACTRL_CMD_IDLE_ENABLE                          (1U)
#define CPSW_CPDMA_DMACTRL_CMD_IDLE_DISABLE                         (0U)

#define CPSW_CPDMA_DMACTRL_RX_CEF_SHIFT                            (4U)
#define CPSW_CPDMA_DMACTRL_RX_CEF_MASK                             (0x00000010U)

#define CPSW_CPDMA_DMACTRL_TX_RLIM_SHIFT                           (8U)
#define CPSW_CPDMA_DMACTRL_TX_RLIM_MASK                            (0x0000ff00U)

#define CPSW_CPDMA_TX_TEARDOWN_TDN_CH_SHIFT                        (0U)
#define CPSW_CPDMA_TX_TEARDOWN_TDN_CH_MASK                         (0x00000007U)

#define CPSW_CPDMA_TX_TEARDOWN_TDN_RDY_SHIFT                       (31U)
#define CPSW_CPDMA_TX_TEARDOWN_TDN_RDY_MASK                        (0x80000000U)

#define CPSW_CPDMA_RX_IDVER_MINOR_VER_SHIFT                        (0U)
#define CPSW_CPDMA_RX_IDVER_MINOR_VER_MASK                         (0x000000ffU)

#define CPSW_CPDMA_RX_IDVER_MAJOR_VER_SHIFT                        (8U)
#define CPSW_CPDMA_RX_IDVER_MAJOR_VER_MASK                         (0x0000ff00U)

#define CPSW_CPDMA_RX_IDVER_IDENT_SHIFT                            (16U)
#define CPSW_CPDMA_RX_IDVER_IDENT_MASK                             (0xffff0000U)

#define CPSW_CPDMA_DMASTS_RX_ERR_CH_SHIFT                          (8U)
#define CPSW_CPDMA_DMASTS_RX_ERR_CH_MASK                           (0x00000700U)

#define CPSW_CPDMA_DMASTS_RX_HOST_ERR_CODE_SHIFT                   (12U)
#define CPSW_CPDMA_DMASTS_RX_HOST_ERR_CODE_MASK                    (0x0000f000U)

#define CPSW_CPDMA_DMASTS_TX_ERR_CH_SHIFT                          (16U)
#define CPSW_CPDMA_DMASTS_TX_ERR_CH_MASK                           (0x00070000U)

#define CPSW_CPDMA_DMASTS_TX_HOST_ERR_CODE_SHIFT                   (20U)
#define CPSW_CPDMA_DMASTS_TX_HOST_ERR_CODE_MASK                    (0x00f00000U)

#define CPSW_CPDMA_DMASTS_IDLE_SHIFT                               (31U)
#define CPSW_CPDMA_DMASTS_IDLE_MASK                                (0x80000000U)
#define CPSW_CPDMA_DMASTS_IDLE_EN_0x1                               (1U)
#define CPSW_CPDMA_DMASTS_IDLE_EN_0x0                               (0U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX0_PEND_SHIFT                (0U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX0_PEND_MASK                 (0x00000001U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX1_PEND_SHIFT                (1U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX1_PEND_MASK                 (0x00000002U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX2_PEND_SHIFT                (2U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX2_PEND_MASK                 (0x00000004U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX3_PEND_SHIFT                (3U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX3_PEND_MASK                 (0x00000008U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX4_PEND_SHIFT                (4U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX4_PEND_MASK                 (0x00000010U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX5_PEND_SHIFT                (5U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX5_PEND_MASK                 (0x00000020U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX6_PEND_SHIFT                (6U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX6_PEND_MASK                 (0x00000040U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX7_PEND_SHIFT                (7U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX7_PEND_MASK                 (0x00000080U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX0_THRESH_PEND_SHIFT         (8U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX0_THRESH_PEND_MASK          (0x00000100U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX1_THRESH_PEND_SHIFT         (9U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX1_THRESH_PEND_MASK          (0x00000200U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX2_THRESH_PEND_SHIFT         (10U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX2_THRESH_PEND_MASK          (0x00000400U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX3_THRESH_PEND_SHIFT         (11U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX3_THRESH_PEND_MASK          (0x00000800U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX4_THRESH_PEND_SHIFT         (12U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX4_THRESH_PEND_MASK          (0x00001000U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX5_THRESH_PEND_SHIFT         (13U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX5_THRESH_PEND_MASK          (0x00002000U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX6_THRESH_PEND_SHIFT         (14U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX6_THRESH_PEND_MASK          (0x00004000U)

#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX7_THRESH_PEND_SHIFT         (15U)
#define CPSW_CPDMA_RX_INTSTAT_MASKED_RX7_THRESH_PEND_MASK          (0x00008000U)

#define CPSW_CPDMA_TX_IDVER_MINOR_VER_SHIFT                        (0U)
#define CPSW_CPDMA_TX_IDVER_MINOR_VER_MASK                         (0x000000ffU)

#define CPSW_CPDMA_TX_IDVER_MAJOR_VER_SHIFT                        (8U)
#define CPSW_CPDMA_TX_IDVER_MAJOR_VER_MASK                         (0x0000ff00U)

#define CPSW_CPDMA_TX_IDVER_IDENT_SHIFT                            (16U)
#define CPSW_CPDMA_TX_IDVER_IDENT_MASK                             (0xffff0000U)

#define CPSW_CPDMA_TX_INTSTAT_RAW_TX0_PEND_SHIFT                   (0U)
#define CPSW_CPDMA_TX_INTSTAT_RAW_TX0_PEND_MASK                    (0x00000001U)

#define CPSW_CPDMA_TX_INTSTAT_RAW_TX1_PEND_SHIFT                   (1U)
#define CPSW_CPDMA_TX_INTSTAT_RAW_TX1_PEND_MASK                    (0x00000002U)

#define CPSW_CPDMA_TX_INTSTAT_RAW_TX2_PEND_SHIFT                   (2U)
#define CPSW_CPDMA_TX_INTSTAT_RAW_TX2_PEND_MASK                    (0x00000004U)

#define CPSW_CPDMA_TX_INTSTAT_RAW_TX3_PEND_SHIFT                   (3U)
#define CPSW_CPDMA_TX_INTSTAT_RAW_TX3_PEND_MASK                    (0x00000008U)

#define CPSW_CPDMA_TX_INTSTAT_RAW_TX4_PEND_SHIFT                   (4U)
#define CPSW_CPDMA_TX_INTSTAT_RAW_TX4_PEND_MASK                    (0x00000010U)

#define CPSW_CPDMA_TX_INTSTAT_RAW_TX5_PEND_SHIFT                   (5U)
#define CPSW_CPDMA_TX_INTSTAT_RAW_TX5_PEND_MASK                    (0x00000020U)

#define CPSW_CPDMA_TX_INTSTAT_RAW_TX6_PEND_SHIFT                   (6U)
#define CPSW_CPDMA_TX_INTSTAT_RAW_TX6_PEND_MASK                    (0x00000040U)

#define CPSW_CPDMA_TX_INTSTAT_RAW_TX7_PEND_SHIFT                   (7U)
#define CPSW_CPDMA_TX_INTSTAT_RAW_TX7_PEND_MASK                    (0x00000080U)

