TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Cpdma.h
#define CPSW_CPDMA_RX_TEARDOWN_TDN_CH_SHIFT                        (0U)
#define CPSW_CPDMA_RX_TEARDOWN_TDN_CH_MASK                         (0x00000007U)

#define CPSW_CPDMA_RX_TEARDOWN_TDN_RDY_SHIFT                       (31U)
#define CPSW_CPDMA_RX_TEARDOWN_TDN_RDY_MASK                        (0x80000000U)

#define CPSW_CPDMA_EOI_VECTOR_DMA_SHIFT                            (0U)
#define CPSW_CPDMA_EOI_VECTOR_DMA_MASK                             (0x0000001fU)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX0_PEND_MASK_SHIFT              (0U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX0_PEND_MASK_MASK               (0x00000001U)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX1_PEND_MASK_SHIFT              (1U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX1_PEND_MASK_MASK               (0x00000002U)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX2_PEND_MASK_SHIFT              (2U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX2_PEND_MASK_MASK               (0x00000004U)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX3_PEND_MASK_SHIFT              (3U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX3_PEND_MASK_MASK               (0x00000008U)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX4_PEND_MASK_SHIFT              (4U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX4_PEND_MASK_MASK               (0x00000010U)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX5_PEND_MASK_SHIFT              (5U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX5_PEND_MASK_MASK               (0x00000020U)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX6_PEND_MASK_SHIFT              (6U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX6_PEND_MASK_MASK               (0x00000040U)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX7_PEND_MASK_SHIFT              (7U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX7_PEND_MASK_MASK               (0x00000080U)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX0_THRESH_PEND_MASK_SHIFT       (8U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX0_THRESH_PEND_MASK_MASK        (0x00000100U)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX1_THRESH_PEND_MASK_SHIFT       (9U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX1_THRESH_PEND_MASK_MASK        (0x00000200U)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX2_THRESH_PEND_MASK_SHIFT       (10U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX2_THRESH_PEND_MASK_MASK        (0x00000400U)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX3_THRESH_PEND_MASK_SHIFT       (11U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX3_THRESH_PEND_MASK_MASK        (0x00000800U)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX4_THRESH_PEND_MASK_SHIFT       (12U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX4_THRESH_PEND_MASK_MASK        (0x00001000U)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX5_THRESH_PEND_MASK_SHIFT       (13U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX5_THRESH_PEND_MASK_MASK        (0x00002000U)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX6_THRESH_PEND_MASK_SHIFT       (14U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX6_THRESH_PEND_MASK_MASK        (0x00004000U)

#define CPSW_CPDMA_RX_INTMASK_CLR_RX7_THRESH_PEND_MASK_SHIFT       (15U)
#define CPSW_CPDMA_RX_INTMASK_CLR_RX7_THRESH_PEND_MASK_MASK        (0x00008000U)

#define CPSW_CPDMA_DMA_INTMASK_CLR_STAT_INT_MASK_SHIFT             (0U)
#define CPSW_CPDMA_DMA_INTMASK_CLR_STAT_INT_MASK_MASK              (0x00000001U)

#define CPSW_CPDMA_DMA_INTMASK_CLR_HOST_ERR_INT_MASK_SHIFT         (1U)
#define CPSW_CPDMA_DMA_INTMASK_CLR_HOST_ERR_INT_MASK_MASK          (0x00000002U)

#define CPSW_CPDMA_RX_FREEBUFFER_RX_SHIFT                          (0U)
#define CPSW_CPDMA_RX_FREEBUFFER_RX_MASK                           (0x0000ffffU)

#define CPSW_CPDMA_TX_CTRL_EN_SHIFT                                (0U)
#define CPSW_CPDMA_TX_CTRL_EN_MASK                                 (0x00000001U)
#define CPSW_CPDMA_TX_CTRL_EN_EN_0x1                                (1U)
#define CPSW_CPDMA_TX_CTRL_EN_EN_0x0                                (0U)

#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX0_PEND_SHIFT                (0U)
#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX0_PEND_MASK                 (0x00000001U)

#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX1_PEND_SHIFT                (1U)
#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX1_PEND_MASK                 (0x00000002U)

#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX2_PEND_SHIFT                (2U)
#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX2_PEND_MASK                 (0x00000004U)

#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX3_PEND_SHIFT                (3U)
#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX3_PEND_MASK                 (0x00000008U)

#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX4_PEND_SHIFT                (4U)
#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX4_PEND_MASK                 (0x00000010U)

#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX5_PEND_SHIFT                (5U)
#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX5_PEND_MASK                 (0x00000020U)

#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX6_PEND_SHIFT                (6U)
#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX6_PEND_MASK                 (0x00000040U)

#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX7_PEND_SHIFT                (7U)
#define CPSW_CPDMA_TX_INTSTAT_MASKED_TX7_PEND_MASK                 (0x00000080U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX0_PEND_SHIFT                   (0U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX0_PEND_MASK                    (0x00000001U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX1_PEND_SHIFT                   (1U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX1_PEND_MASK                    (0x00000002U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX2_PEND_SHIFT                   (2U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX2_PEND_MASK                    (0x00000004U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX3_PEND_SHIFT                   (3U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX3_PEND_MASK                    (0x00000008U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX4_PEND_SHIFT                   (4U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX4_PEND_MASK                    (0x00000010U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX5_PEND_SHIFT                   (5U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX5_PEND_MASK                    (0x00000020U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX6_PEND_SHIFT                   (6U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX6_PEND_MASK                    (0x00000040U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX7_PEND_SHIFT                   (7U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX7_PEND_MASK                    (0x00000080U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX0_THRESH_PEND_SHIFT            8U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX0_THRESH_PEND_MASK             (0x00000100U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX1_THRESH_PEND_SHIFT            (9U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX1_THRESH_PEND_MASK             (0x00000200U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX2_THRESH_PEND_SHIFT            (10U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX2_THRESH_PEND_MASK             (0x00000400U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX3_THRESH_PEND_SHIFT            (11U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX3_THRESH_PEND_MASK             (0x00000800U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX4_THRESH_PEND_SHIFT            (12U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX4_THRESH_PEND_MASK             (0x00001000U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX5_THRESH_PEND_SHIFT            (13U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX5_THRESH_PEND_MASK             (0x00002000U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX6_THRESH_PEND_SHIFT            (14U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX6_THRESH_PEND_MASK             (0x00004000U)

#define CPSW_CPDMA_RX_INTSTAT_RAW_RX7_THRESH_PEND_SHIFT            (15U)
#define CPSW_CPDMA_RX_INTSTAT_RAW_RX7_THRESH_PEND_MASK             (0x00008000U)

#define CPSW_CPDMA_RX_CTRL_EN_SHIFT                                (0U)
#define CPSW_CPDMA_RX_CTRL_EN_MASK                                 (0x00000001U)
#define CPSW_CPDMA_RX_CTRL_EN_EN_0x1                                (1U)
#define CPSW_CPDMA_RX_CTRL_EN_EN_0x0                                (0U)

#ifdef __cplusplus
}
#endif
#endif  /* HW_CPSW_CPDMA_H_ */

